In [1]:
import pandas as pd

df = pd.read_csv('mtcars.csv')
df.head()

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [3]:
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler()

df['qsec'] = scaler.fit_transform(df[['qsec']])
df.head()

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,0.233333,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,0.300000,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,0.489286,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,0.588095,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,0.300000,0,0,3,2

In [4]:
from sklearn.preprocessing import minmax_scale

df['qsec'] = minmax_scale(df['qsec'])
df.head()

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,0.233333,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,0.300000,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,0.489286,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,0.588095,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,0.300000,0,0,3,2

In [ ]:
cond = df['qsec'] > 0.5
sum(cond)
len(df[cond])
df[cond]['qsec'].count()

np.int64(9)

In [14]:
df = pd.read_csv('members.csv')
df.head()

     id   age city    f1  f2    f3    f4         f5  subscribed   views
0  id01   2.0   서울   NaN   0  gold  ENFJ  91.297791  2021-07-16  6820.0
1  id02   9.0   서울  70.0   1   NaN  ENFJ  60.339826  2021-05-12  2534.0
2  id03  27.0   서울  61.0   1  gold  ISTJ  17.252986  2021-03-16  7312.0
3  id04  75.0   서울   NaN   2   NaN  INFP  52.667078  2021-07-21   493.0
4  id05  24.0   서울  85.0   2   NaN  ISFJ  29.269869  2021-03-07  1338.0

In [22]:
df = pd.read_csv('members.csv')
df.head()

df = df.sort_values('views', ascending=False)
min_value = df.iloc[9]['views']

In [24]:
df.iloc[:10, -1] = min_value
df.head(12)

       id   age city    f1  f2    f3    f4         f5  subscribed   views
5    id06  22.0   서울  57.0   0   vip  INTP  20.129444  2021-09-12  9690.0
56   id56  59.0   대구   NaN   1   vip  ESTJ  73.586397  2021-04-05  9690.0
83   id83  73.0   경기  50.0   1   vip  ENTP  80.138280  2021-09-26  9690.0
32   id32  25.0   부산  64.0   0   vip  ISFJ  13.049921  2021-05-24  9690.0
10  id100  47.0   경기  53.0   0   vip  ESFP  33.308999  2021-02-21  9690.0
9    id10  95.0   서울  74.0   1  gold  ISFP  98.429899  2021-04-03  9690.0
49   id49  75.0   대구  88.0   0  gold  INTP  37.113739  2021-03-31  9690.0
36   id36  68.0   부산  77.0   1  gold  INTP  13.049921  2021-07-20  9690.0
46   id46  93.0   대구   NaN   0  gold  ESTJ  67.886373  2021-05-23  9690.0
21   id21  90.0   부산   NaN   1  gold  ISFP  29.269869  2021-05-03  9690.0
92   id92  97.0   경기  78.0   1  gold  INFP  97.381034  2021-05-08  9625.0
16   id16  68.0   서울  85.0   0  gold  ESFP  16.283854  2021-07-25  9472.0

In [25]:
cond = df['age'] >= 80
df[cond]['views'].mean()

np.float64(5674.04347826087)

In [28]:
df = pd.read_csv('members.csv')
df.head()
df.info

<bound method DataFrame.info of       id    age city    f1  f2      f3    f4         f5  subscribed   views
0   id01    2.0   서울   NaN   0    gold  ENFJ  91.297791  2021-07-16  6820.0
1   id02    9.0   서울  70.0   1     NaN  ENFJ  60.339826  2021-05-12  2534.0
2   id03   27.0   서울  61.0   1    gold  ISTJ  17.252986  2021-03-16  7312.0
3   id04   75.0   서울   NaN   2     NaN  INFP  52.667078  2021-07-21   493.0
4   id05   24.0   서울  85.0   2     NaN  ISFJ  29.269869  2021-03-07  1338.0
..   ...    ...  ...   ...  ..     ...   ...        ...         ...     ...
95  id95   77.0   경기  43.0   1    gold  INTJ  91.297791  2021-05-21  8697.0
96  id96   92.0   경기  53.0   1  silver  ENTJ  52.667078  2021-05-06  4336.0
97  id97  100.0   경기   NaN   0    gold  INFP  67.886373  2021-03-18  6687.0
98  id98   39.0   경기  58.0   2     NaN  INFP  98.429899  2021-10-02   865.0
99  id99    1.0   경기  47.0   0    gold  ESFJ  97.381034  2021-12-02  6090.0

[100 rows x 10 columns]>

In [ ]:
line  = int(len(df) * 0.8)
line

80

In [29]:
df = df[:80]
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80 entries, 0 to 79
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          80 non-null     object
 1   age         80 non-null     float64
 2   city        80 non-null     object
 3   f1          55 non-null     float64
 4   f2          80 non-null     int64
 5   f3          58 non-null     object
 6   f4          80 non-null     object
 7   f5          80 non-null     float64
 8   subscribed  80 non-null     object
 9   views       77 non-null     float64
dtypes: float64(4), int64(1), object(5)
memory usage: 6.4+ KB

In [30]:
std1 = df['f1'].std()
std1

np.float64(20.574853076621935)

In [31]:
median = df['f1'].median()
median

np.float64(68.0)

In [32]:
df['f1'] = df['f1'].fillna(median)
df.isnull().sum()

C:\Users\user\AppData\Local\Temp\ipykernel_35144\3330301574.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['f1'] = df['f1'].fillna(median)

id             0
age            0
city           0
f1             0
f2             0
f3            22
f4             0
f5             0
subscribed     0
views          3
dtype: int64

In [34]:
std2 = df['f1'].std()
std2

np.float64(17.010788646613268)

In [35]:
print(abs(std1 - std2))

3.564064430008667

In [36]:
df = pd.read_csv('members.csv')
df

      id    age city    f1  f2      f3    f4         f5  subscribed   views
0   id01    2.0   서울   NaN   0    gold  ENFJ  91.297791  2021-07-16  6820.0
1   id02    9.0   서울  70.0   1     NaN  ENFJ  60.339826  2021-05-12  2534.0
2   id03   27.0   서울  61.0   1    gold  ISTJ  17.252986  2021-03-16  7312.0
3   id04   75.0   서울   NaN   2     NaN  INFP  52.667078  2021-07-21   493.0
4   id05   24.0   서울  85.0   2     NaN  ISFJ  29.269869  2021-03-07  1338.0
..   ...    ...  ...   ...  ..     ...   ...        ...         ...     ...
95  id95   77.0   경기  43.0   1    gold  INTJ  91.297791  2021-05-21  8697.0
96  id96   92.0   경기  53.0   1  silver  ENTJ  52.667078  2021-05-06  4336.0
97  id97  100.0   경기   NaN   0    gold  INFP  67.886373  2021-03-18  6687.0
98  id98   39.0   경기  58.0   2     NaN  INFP  98.429899  2021-10-02   865.0
99  id99    1.0   경기  47.0   0    gold  ESFJ  97.381034  2021-12-02  6090.0

[100 rows x 10 columns]

In [37]:
mean = df['age'].mean()
mean

np.float64(50.963)

In [39]:
std = df['age'].std() * 1.5
std

np.float64(45.66413778388304)

In [40]:
lower = mean-std
upper = mean+std
lower, upper

(np.float64(5.298862216116959), np.float64(96.62713778388304))

In [42]:
cond1 = df['age'] < lower
cond2 = df['age'] > upper

df = df[cond1 | cond2]
print(sum(df['age']))

473.5

In [20]:
import pandas as pd

df = pd.read_csv('members.csv')
df

      id    age city    f1  f2      f3    f4         f5  subscribed   views
0   id01    2.0   서울   NaN   0    gold  ENFJ  91.297791  2021-07-16  6820.0
1   id02    9.0   서울  70.0   1     NaN  ENFJ  60.339826  2021-05-12  2534.0
2   id03   27.0   서울  61.0   1    gold  ISTJ  17.252986  2021-03-16  7312.0
3   id04   75.0   서울   NaN   2     NaN  INFP  52.667078  2021-07-21   493.0
4   id05   24.0   서울  85.0   2     NaN  ISFJ  29.269869  2021-03-07  1338.0
..   ...    ...  ...   ...  ..     ...   ...        ...         ...     ...
95  id95   77.0   경기  43.0   1    gold  INTJ  91.297791  2021-05-21  8697.0
96  id96   92.0   경기  53.0   1  silver  ENTJ  52.667078  2021-05-06  4336.0
97  id97  100.0   경기   NaN   0    gold  INFP  67.886373  2021-03-18  6687.0
98  id98   39.0   경기  58.0   2     NaN  INFP  98.429899  2021-10-02   865.0
99  id99    1.0   경기  47.0   0    gold  ESFJ  97.381034  2021-12-02  6090.0

[100 rows x 10 columns]

In [13]:
df = df.dropna()
len(df)

51

In [14]:
len_70 = int(len(df)*0.7)
len_70

35

In [15]:
df_70 = df[:len_70]
len(df_70)

35

In [16]:
f1_1 = df_70['f1'].quantile(0.25)
f1_1

np.float64(57.0)

In [22]:
df = df.isnull().sum()
df = df.sort_values(ascending=False)
df.index[0]

'f1'

In [23]:
import pandas as pd

df = pd.read_csv('basic1.csv')
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [25]:
q3 = df['age'].quantile(0.75)
q1 = df['age'].quantile(0.25)

int(abs(q3-q1))

50

In [34]:
import pandas as pd

df = pd.read_csv('fb.csv')
df.head()

,id,type,reactions,comments,shares,likes,loves,wows,hahas,sads,angrys
0,1,video,529,512,262,432,92,3,1,1,0
1,2,photo,150,0,0,150,0,0,0,0,0
2,3,video,227,236,57,204,21,1,1,0,0
3,4,photo,111,0,0,111,0,0,0,0,0
4,5,photo,213,0,0,204,9,0,0,0,0

In [ ]:
df['result'] = (df['loves'] + df['wows']) / df['reactions'] # 괄호 묶음!
df

,id,type,reactions,comments,shares,likes,loves,wows,hahas,sads,angrys,result
0,1,video,529,512,262,432,92,3,1,1,0,0.179584
1,2,photo,150,0,0,150,0,0,0,0,0,0.000000
2,3,video,227,236,57,204,21,1,1,0,0,0.096916
3,4,photo,111,0,0,111,0,0,0,0,0,0.000000
4,5,photo,213,0,0,204,9,0,0,0,0,0.042254
...,...,...,...,...,...,...,...,...,...,...,...,...
7045,7046,photo,89,0,0,89,0,0,0,0,0,0.000000
7046,7047,photo,16,0,0,14,1,0,1,0,0,0.062500
7047,7048,photo,2,0,0,1,1,0,0,0,0,0.500000
7048,7049,photo,351,12,22,349,2,0,0,0,0,0.005698
7049,7050,photo,17,0,0,17,0,0,0,0,0,0.000000

In [37]:
cond1 = df['result'] > 0.4
cond2 = df['result'] < 0.5
cond3 = df['type'] == 'video'

df = df[cond1 & cond2 & cond3]
print(len(df))

90

In [38]:
import pandas as pd

df = pd.read_csv('nf.csv')
df.head()

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries"
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act..."
3,s4,TV Show,Jailbirds New Orleans,NaN,NaN,NaN,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV"
4,s5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ..."

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8807 entries, 0 to 8806
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       8807 non-null   object
 1   type          8807 non-null   object
 2   title         8807 non-null   object
 3   director      6173 non-null   object
 4   cast          7982 non-null   object
 5   country       7976 non-null   object
 6   date_added    8797 non-null   object
 7   release_year  8807 non-null   int64
 8   rating        8803 non-null   object
 9   duration      8804 non-null   object
 10  listed_in     8807 non-null   object
dtypes: int64(1), object(10)
memory usage: 757.0+ KB

In [43]:
df['date_added'] = pd.to_datetime(df['date_added'])

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8807 entries, 0 to 8806
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       8807 non-null   object
 1   type          8807 non-null   object
 2   title         8807 non-null   object
 3   director      6173 non-null   object
 4   cast          7982 non-null   object
 5   country       7976 non-null   object
 6   date_added    8797 non-null   datetime64[ns]
 7   release_year  8807 non-null   int64
 8   rating        8803 non-null   object
 9   duration      8804 non-null   object
 10  listed_in     8807 non-null   object
dtypes: datetime64[ns](1), int64(1), object(9)
memory usage: 757.0+ KB

In [47]:
cond1 = df['date_added'].dt.year == 2018
cond2 = df['date_added'].dt.month == 1
cond3 = df['country'] == 'United Kingdom'

len(df[cond1 & cond2 & cond3])

6

In [50]:
import pandas as pd

df = pd.read_csv('5-1price.csv')
df.head(1)

,시도명,시군구명,종량제봉투종류,종량제봉투처리방식,종량제봉투용도,종량제봉투사용대상,1ℓ가격,1.5ℓ가격,2ℓ가격,2.5ℓ가격,...,60ℓ가격,75ℓ가격,100ℓ가격,120ℓ가격,125ℓ가격,관리부서명,관리부서전화번호,데이터기준일자,제공기관코드,제공기관명
0,경기도,안양시,규격봉투,매립용,생활쓰레기,사업장용,0,0,0,0,...,0,2100,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시

In [57]:
cond1 = df['종량제봉투종류'] == '규격봉투' 
cond2 = df['종량제봉투용도'] == '음식물쓰레기' 
cond3 = df['2ℓ가격'] != 0

mean = df[cond1 & cond2 & cond3]['2ℓ가격'].mean()
mean
print(round(mean))

118

In [58]:
import pandas as pd

df = pd.read_csv('5-2bmi.csv')
df

      Gender  Height  Weight
0       Male   187.6   109.7
1       Male   174.7    73.6
2       Male   188.2    96.5
3       Male   182.2    99.8
4       Male   177.5    93.6
...      ...     ...     ...
9995  Female   168.1    62.0
9996  Female   170.4    77.5
9997  Female   162.2    58.3
9998  Female   175.3    74.3
9999  Female   157.3    51.6

[10000 rows x 3 columns]

In [60]:
df['bmi'] = df['Weight'] / (df['Height']/100) ** 2
df

      Gender  Height  Weight        bmi
0       Male   187.6   109.7  31.170298
1       Male   174.7    73.6  24.115263
2       Male   188.2    96.5  27.245079
3       Male   182.2    99.8  30.063102
4       Male   177.5    93.6  29.708391
...      ...     ...     ...        ...
9995  Female   168.1    62.0  21.940992
9996  Female   170.4    77.5  26.690857
9997  Female   162.2    58.3  22.159852
9998  Female   175.3    74.3  24.178257
9999  Female   157.3    51.6  20.854139

[10000 rows x 4 columns]

In [61]:
cond1 = (df['bmi'] >= 18.5) & (df['bmi'] < 23)
cond2 = (df['bmi'] >= 23) & (df['bmi'] < 25)

print(abs(len(df[cond1]) - len(df[cond2])))

144

In [70]:
import pandas as pd

df = pd.read_csv('5-3student.csv')
df

,시도교육청,지역교육청,지역,정보공시 학교코드,학교명,학교급코드,설립구분,제외여부,제외사유,1학년 전입학생수,...,4학년 전체학생수,5학년 전입학생수,5학년 전출학생수,5학년 전체학생수,6학년 전입학생수,6학년 전출학생수,6학년 전체 학생수,전입학생수(계),전출학생수(계),전체학생수(계)
0,서울특별시교육청,교육부,서울특별시 서초구,S000003511,서울교육대학교부설초등학교,2,국립,N,NaN,5.0,...,104.0,0.0,0.0,108.0,0.0,0.0,111.0,6.0,0.0,611.0
1,서울특별시교육청,교육부,서울특별시 종로구,S000003563,서울대학교사범대학부설초등학교,2,국립,N,NaN,4.0,...,104.0,3.0,2.0,104.0,0.0,1.0,106.0,20.0,21.0,621.0
2,서울특별시교육청,서울특별시강남서초교육지원청,서울특별시 강남구,S010000738,서울개일초등학교,2,공립,N,NaN,13.0,...,179.0,19.0,8.0,177.0,16.0,5.0,152.0,118.0,50.0,1004.0
3,서울특별시교육청,서울특별시강남서초교육지원청,서울특별시 강남구,S010000741,서울구룡초등학교,2,공립,N,NaN,2.0,...,129.0,18.0,4.0,129.0,13.0,3.0,119.0,90.0,27.0,733.0
4,서울특별시교육청,서울특별시강남서초교육지원청,서울특별시 강남구,S010000742,서울논현초등학교,2,공립,N,NaN,1.0,...,48.0,2.0,10.0,53.0,0.0,0.0,47.0,6.0,29.0,290.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6304,제주특별자치도교육청,제주시교육지원청,제주특별자치도 제주시,S170000801,월랑초등학교,2,공립,N,NaN,1.0,...,129.0,8.0,4.0,135.0,1.0,4.0,106.0,22.0,26.0,699.0
6305,제주특별자치도교육청,제주시교육지원청,제주특별자치도 제주시,S170000834,이도초등학교,2,공립,N,NaN,2.0,...,192.0,4.0,6.0,218.0,2.0,3.0,174.0,29.0,47.0,1182.0
6306,제주특별자치도교육청,제주시교육지원청,제주특별자치도 제주시,S170000836,도련초등학교,2,공립,N,NaN,2.0,...,200.0,3.0,6.0,183.0,1.0,6.0,150.0,22.0,51.0,1170.0
6307,제주특별자치도교육청,제주시교육지원청,제주특별자치도 제주시,S170000837,삼화초등학교,2,공립,N,NaN,6.0,...,145.0,6.0,6.0,128.0,3.0,6.0,158.0,31.0,42.0,795.0
6308,제주특별자치도교육청,제주시교육지원청,제주특별자치도 제주시,S170000839,하귀일초등학교,2,공립,N,NaN,13.0,...,95.0,9.0,13.0,103.0,8.0,17.0,108.0,79.0,76.0,624.0

In [71]:
df['순전입'] = df['전입학생수(계)'] - df['전출학생수(계)']
df

,시도교육청,지역교육청,지역,정보공시 학교코드,학교명,학교급코드,설립구분,제외여부,제외사유,1학년 전입학생수,...,5학년 전입학생수,5학년 전출학생수,5학년 전체학생수,6학년 전입학생수,6학년 전출학생수,6학년 전체 학생수,전입학생수(계),전출학생수(계),전체학생수(계),순전입
0,서울특별시교육청,교육부,서울특별시 서초구,S000003511,서울교육대학교부설초등학교,2,국립,N,NaN,5.0,...,0.0,0.0,108.0,0.0,0.0,111.0,6.0,0.0,611.0,6.0
1,서울특별시교육청,교육부,서울특별시 종로구,S000003563,서울대학교사범대학부설초등학교,2,국립,N,NaN,4.0,...,3.0,2.0,104.0,0.0,1.0,106.0,20.0,21.0,621.0,-1.0
2,서울특별시교육청,서울특별시강남서초교육지원청,서울특별시 강남구,S010000738,서울개일초등학교,2,공립,N,NaN,13.0,...,19.0,8.0,177.0,16.0,5.0,152.0,118.0,50.0,1004.0,68.0
3,서울특별시교육청,서울특별시강남서초교육지원청,서울특별시 강남구,S010000741,서울구룡초등학교,2,공립,N,NaN,2.0,...,18.0,4.0,129.0,13.0,3.0,119.0,90.0,27.0,733.0,63.0
4,서울특별시교육청,서울특별시강남서초교육지원청,서울특별시 강남구,S010000742,서울논현초등학교,2,공립,N,NaN,1.0,...,2.0,10.0,53.0,0.0,0.0,47.0,6.0,29.0,290.0,-23.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6304,제주특별자치도교육청,제주시교육지원청,제주특별자치도 제주시,S170000801,월랑초등학교,2,공립,N,NaN,1.0,...,8.0,4.0,135.0,1.0,4.0,106.0,22.0,26.0,699.0,-4.0
6305,제주특별자치도교육청,제주시교육지원청,제주특별자치도 제주시,S170000834,이도초등학교,2,공립,N,NaN,2.0,...,4.0,6.0,218.0,2.0,3.0,174.0,29.0,47.0,1182.0,-18.0
6306,제주특별자치도교육청,제주시교육지원청,제주특별자치도 제주시,S170000836,도련초등학교,2,공립,N,NaN,2.0,...,3.0,6.0,183.0,1.0,6.0,150.0,22.0,51.0,1170.0,-29.0
6307,제주특별자치도교육청,제주시교육지원청,제주특별자치도 제주시,S170000837,삼화초등학교,2,공립,N,NaN,6.0,...,6.0,6.0,128.0,3.0,6.0,158.0,31.0,42.0,795.0,-11.0
6308,제주특별자치도교육청,제주시교육지원청,제주특별자치도 제주시,S170000839,하귀일초등학교,2,공립,N,NaN,13.0,...,9.0,13.0,103.0,8.0,17.0,108.0,79.0,76.0,624.0,3.0

In [72]:
df = df.sort_values('순전입', ascending=False)
df.head()

,시도교육청,지역교육청,지역,정보공시 학교코드,학교명,학교급코드,설립구분,제외여부,제외사유,1학년 전입학생수,...,5학년 전입학생수,5학년 전출학생수,5학년 전체학생수,6학년 전입학생수,6학년 전출학생수,6학년 전체 학생수,전입학생수(계),전출학생수(계),전체학생수(계),순전입
1880,세종특별자치시교육청,세종특별자치시교육청,세종특별자치시 세종특별자치시,S080000206,나성초등학교,2,공립,N,NaN,159.0,...,180.0,0.0,41.0,89.0,0.0,31.0,923.0,0.0,230.0,923.0
1382,인천광역시교육청,인천광역시서부교육지원청,인천광역시 서구,S040002035,인천한별초등학교,2,공립,N,NaN,179.0,...,127.0,0.0,0.0,93.0,0.0,0.0,857.0,4.0,0.0,853.0
6190,경상남도교육청,창원교육지원청,경상남도 창원시 마산합포구,S160004071,마산고운초등학교,2,공립,N,NaN,37.0,...,139.0,1.0,110.0,115.0,1.0,97.0,856.0,13.0,894.0,843.0
3214,경기도교육청,경기도성남교육지원청,경기도 성남시 분당구,S090007517,판교대장초등학교,2,공립,N,NaN,150.0,...,97.0,0.0,0.0,72.0,1.0,0.0,688.0,2.0,0.0,686.0
1407,인천광역시교육청,인천광역시동부교육지원청,인천광역시 연수구,S040002304,인천송담초등학교,2,공립,N,NaN,10.0,...,139.0,3.0,134.0,85.0,1.0,70.0,712.0,30.0,835.0,682.0

In [77]:
print(int(df.iloc[0]['전체학생수(계)']))

230

In [78]:
import pandas as pd

df = pd.read_csv('data6-1-1.csv')
df.head(1)

    소방서                 출동시간                 도착시간
0  소방서1  2023-09-16 06:12:29  2023-09-16 07:51:55

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   소방서     100 non-null    object
 1   출동시간    100 non-null    object
 2   도착시간    100 non-null    object
dtypes: object(3)
memory usage: 2.5+ KB

In [81]:
df['출동시간'] = pd.to_datetime(df['출동시간'])
df['도착시간'] = pd.to_datetime(df['도착시간'])
df.head()

    소방서                출동시간                도착시간
0  소방서1 2023-09-16 06:12:29 2023-09-16 07:51:55
1  소방서5 2023-09-19 06:11:41 2023-09-19 08:08:36
2  소방서1 2023-09-14 06:12:00 2023-09-14 07:24:21
3  소방서6 2023-09-20 06:12:24 2023-09-20 06:30:45
4  소방서9 2023-09-15 06:11:50 2023-09-15 06:44:00

In [82]:
df['차이'] = df['도착시간'] - df['출동시간']
df

     소방서                출동시간                도착시간              차이
0   소방서1 2023-09-16 06:12:29 2023-09-16 07:51:55 0 days 01:39:26
1   소방서5 2023-09-19 06:11:41 2023-09-19 08:08:36 0 days 01:56:55
2   소방서1 2023-09-14 06:12:00 2023-09-14 07:24:21 0 days 01:12:21
3   소방서6 2023-09-20 06:12:24 2023-09-20 06:30:45 0 days 00:18:21
4   소방서9 2023-09-15 06:11:50 2023-09-15 06:44:00 0 days 00:32:10
..   ...                 ...                 ...             ...
95  소방서6 2023-09-17 06:12:02 2023-09-17 06:16:49 0 days 00:04:47
96  소방서6 2023-09-18 06:12:05 2023-09-18 06:41:31 0 days 00:29:26
97  소방서4 2023-09-12 06:11:52 2023-09-12 08:10:19 0 days 01:58:27
98  소방서7 2023-09-12 06:12:22 2023-09-12 07:02:26 0 days 00:50:04
99  소방서8 2023-09-20 06:12:16 2023-09-20 06:30:46 0 days 00:18:30

[100 rows x 4 columns]

In [85]:
df['차이'] = df['차이'].dt.total_seconds() / 60

In [86]:
df.groupby('소방서').mean()

                               출동시간                          도착시간         차이
소방서
소방서1  2023-09-14 18:12:02.714285824 2023-09-14 19:06:59.857143040  54.952381
소방서10 2023-09-16 03:48:15.500000000 2023-09-16 04:30:37.400000000  42.365000
소방서2  2023-09-13 16:29:20.857143040 2023-09-13 17:29:34.571428608  60.228571
소방서3  2023-09-15 11:31:56.444444416 2023-09-15 12:15:25.888888832  43.490741
소방서4  2023-09-13 20:35:57.300000000 2023-09-13 21:25:05.500000000  49.136667
소방서5  2023-09-15 23:00:03.500000000 2023-09-16 00:01:18.500000000  61.250000
소방서6  2023-09-16 06:12:12.875000064 2023-09-16 06:53:58.750000128  41.764583
소방서7  2023-09-15 14:12:06.555555584 2023-09-15 15:08:46.777777664  56.670370
소방서8  2023-09-16 03:11:56.124999936 2023-09-16 03:54:37.750000128  42.693750
소방서9  2023-09-14 22:12:02.800000000 2023-09-14 23:32:42.333333248  80.658889

In [90]:
result = df.groupby('소방서').mean().sort_values('차이', ascending=False)
result

                               출동시간                          도착시간         차이
소방서
소방서9  2023-09-14 22:12:02.800000000 2023-09-14 23:32:42.333333248  80.658889
소방서5  2023-09-15 23:00:03.500000000 2023-09-16 00:01:18.500000000  61.250000
소방서2  2023-09-13 16:29:20.857143040 2023-09-13 17:29:34.571428608  60.228571
소방서7  2023-09-15 14:12:06.555555584 2023-09-15 15:08:46.777777664  56.670370
소방서1  2023-09-14 18:12:02.714285824 2023-09-14 19:06:59.857143040  54.952381
소방서4  2023-09-13 20:35:57.300000000 2023-09-13 21:25:05.500000000  49.136667
소방서3  2023-09-15 11:31:56.444444416 2023-09-15 12:15:25.888888832  43.490741
소방서8  2023-09-16 03:11:56.124999936 2023-09-16 03:54:37.750000128  42.693750
소방서10 2023-09-16 03:48:15.500000000 2023-09-16 04:30:37.400000000  42.365000
소방서6  2023-09-16 06:12:12.875000064 2023-09-16 06:53:58.750000128  41.764583

In [95]:
print(round(result.iloc[0]['차이']))

81

In [96]:
import pandas as pd 

df = pd.read_csv('data6-1-2.csv')
df

      학교명  교사수  1학년  2학년  3학년  4학년  5학년  6학년
0     학교1   20  118   72  154  118   77   59
1     학교2   31  187  193  135  137   63   90
2     학교3   23  136  193  135  112   91   50
3     학교4   32   72  146   67   51  130  164
4     학교5   22   61   73   86   82   55  124
..    ...  ...  ...  ...  ...  ...  ...  ...
95   학교96   38   75  166  113  191  172   57
96   학교97   30  125  169  145  122  187  194
97   학교98   37  136  100   93   60  145   63
98   학교99   37   74  175  145  157   95   76
99  학교100   40   68  109  196  148   84  179

[100 rows x 8 columns]

In [100]:
df['전체'] = df.iloc[:, 2:].sum(axis=1)
df

      학교명  교사수  1학년  2학년  3학년  4학년  5학년  6학년   전체
0     학교1   20  118   72  154  118   77   59  598
1     학교2   31  187  193  135  137   63   90  805
2     학교3   23  136  193  135  112   91   50  717
3     학교4   32   72  146   67   51  130  164  630
4     학교5   22   61   73   86   82   55  124  481
..    ...  ...  ...  ...  ...  ...  ...  ...  ...
95   학교96   38   75  166  113  191  172   57  774
96   학교97   30  125  169  145  122  187  194  942
97   학교98   37  136  100   93   60  145   63  597
98   학교99   37   74  175  145  157   95   76  722
99  학교100   40   68  109  196  148   84  179  784

[100 rows x 9 columns]

In [101]:
df['div'] = df['전체'] / df['교사수']
df

      학교명  교사수  1학년  2학년  3학년  4학년  5학년  6학년   전체        div
0     학교1   20  118   72  154  118   77   59  598  29.900000
1     학교2   31  187  193  135  137   63   90  805  25.967742
2     학교3   23  136  193  135  112   91   50  717  31.173913
3     학교4   32   72  146   67   51  130  164  630  19.687500
4     학교5   22   61   73   86   82   55  124  481  21.863636
..    ...  ...  ...  ...  ...  ...  ...  ...  ...        ...
95   학교96   38   75  166  113  191  172   57  774  20.368421
96   학교97   30  125  169  145  122  187  194  942  31.400000
97   학교98   37  136  100   93   60  145   63  597  16.135135
98   학교99   37   74  175  145  157   95   76  722  19.513514
99  학교100   40   68  109  196  148   84  179  784  19.600000

[100 rows x 10 columns]

In [103]:
df = df.sort_values('div', ascending=False)
print(df.iloc[0]['교사수'])

19

In [106]:
import pandas as pd

df = pd.read_csv('data6-1-3.csv')
df.head()

          날짜  강력범죄  절도범죄  폭력범죄  지능범죄  풍속범죄  교통범죄  경찰서명
0  2020년 04월    26   142    83    71    33   182  B경찰서
1  2021년 06월    12   131    78    65    30   201  E경찰서
2  2020년 06월    22   104    84    72    34   201  A경찰서
3  2024년 02월    16   137    72    80    30   180  C경찰서
4  2022년 03월    17   125    87    76    25   220  C경찰서

In [ ]:
df['총범죄'] = df.iloc[:, 1:-1].sum(axis=1)

TypeError: unsupported operand type(s) for +: 'int' and 'str'

In [111]:
df.head()

          날짜  강력범죄  절도범죄  폭력범죄  지능범죄  풍속범죄  교통범죄  경찰서명  총범죄
0  2020년 04월    26   142    83    71    33   182  B경찰서  537
1  2021년 06월    12   131    78    65    30   201  E경찰서  517
2  2020년 06월    22   104    84    72    34   201  A경찰서  517
3  2024년 02월    16   137    72    80    30   180  C경찰서  515
4  2022년 03월    17   125    87    76    25   220  C경찰서  550

In [115]:
df['연도'] = df['날짜'].str[0:4]
df['연도']

0     2020
1     2021
2     2020
3     2024
4     2022
5     2024
6     2020
7     2020
8     2022
9     2022
10    2022
11    2021
12    2024
13    2024
14    2020
15    2020
16    2023
17    2024
18    2023
19    2021
20    2023
21    2020
22    2022
23    2024
24    2024
25    2020
26    2023
27    2021
28    2022
29    2023
30    2022
31    2020
32    2024
33    2023
34    2024
35    2022
36    2022
37    2020
38    2021
39    2021
40    2023
41    2023
42    2021
43    2022
44    2021
45    2023
46    2022
47    2021
48    2020
49    2022
Name: 연도, dtype: object

In [117]:
result = df.groupby('연도')['총범죄'].sum()/12

In [120]:
print(round(result.max()))

515